export const title = 'Смотрины';
export const description = 'Сайт способствующий саморазвитию, свиданиям и созданию Семьи (предложение)';
export const proposal = 'предложение';
export const Proposal = 'Предложение';
export const pictureTooltip = 'Н. П. Петров. Смотрины невесты. 1861';
export const email = 'Почта';
export const notifyMeWhenAvailable = 'Сообщите когда запустите!';
export const footer = 'смотрины.укр & смотрины.рус';

export const Idea = 'Идея';
export const FirstStage = 'Первый этап пользования системой:';
export const FirstStageFirstStep = '1. Участники заполняют анкету, указывая свою эл. почту, пол, дату рождения, город, тип внешности, рост/вес, состояние здоровья и пр.;';
export const FirstStageSecondStep = '2. При соответствующих положительных собственных оценках здоровья, системой будут организованы свидания между подходящими по возрасту/городу участниками (В случае проблем со здоровьем, вредными привычками и пр. системой будут предложены способы их преодоления);';
export const FirstStageThirdStep = '3. Этап обратной связи, в котором участники решают хотят они продолжать отношения или нет. Вне зависимости от выбора, участники дают оценку правдивости анкет друг друга в вежливой и конструктивной форме;';
export const FirstStageFourthStep = '4. В случае совпадения желания обоих участников продолжать отношения они внимательно познают друг друга в реальной жизни и меняют цель использования системы с "хочу найти вторую половинку" на "хотим завести детей" (детали взаимодействия с системой на данном этапе будут оглашены позже). Иначе - происходит возврат ко второму шагу.';

export const AreDatingSitesNeeded = 'Нужны ли вообще сайты знакомств?';
export const MotivationOfNeedTitle = 'С точки зрения создателя данного ресурса в них есть польза для современного общества, заключающаяся в следующем:';
export const explicitIntention = 'человек имеет возможность явно выразить свое желание найти свою вторую половинку (облегчая таким образом этот процес и для себя и для других пользователей со схожими целями);';
export const motivateSelfImprovement = 'особенностью данного сайта также будет поощрение саморазвития участников, создания семьи и рождения детей.';
export const WhyNot = 'Действительно, воспринимать Интернет ресурс как однозначное решение всех жизненных проблем не стоит, но можно добавить его к себе в помощники ';

export const AnotherDatingSite = 'Очередной сайт знакомств?';
export const YesOneOfGoalsIsDating = 'Да, одной из целей данного ресурса будет облегчение знакомств через сеть Интернет.';
export const ButThereAreDifferences = 'Однако от существующих на текущий момент решений (love.ua, tinder.com, loveeto.com, badoo.com, mamba.ru) будет ряд существенных отличий, среди которых:';
export const onlyActiveParticipants = 'только активные, уважающие друг друга пользователи (неактивные, нарушающие правила участники будут предупреждаться, а также блокироваться в случае продолжения подобного поведения);';
export const moreInvolvedSystem = 'более активное участие системы для воплощения целей пользователей (участники не будут иметь возможности сидеть и просматривать анкеты друг друга, пары будет предлагать система);';
export const feedbackSystem = 'система обратной связи после свиданий (встреча не обязывает жениться/выходить замуж, но конструктивный отзыв необходим в любом случае);';
export const fullFeaturedForFree = 'возможность свободно пользоваться полноценной системой без рекламы, премиум подписок и прочего (возможность поддержать ресурс может быть только добровольной, если человек получил пользу и хочет отблагодарить его создателей) и пр.';

export const Email = 'Почта для обратной связи';

export const emailVerification = 'Подтверждение почты';

export const tokenName = 'токен';
export const sendNewVerificationToken = 'Отправить новый токен';
