export const title = "Смотрины";
export const description =
  "Платформа для саморазвития, свиданий и создания Семьи";
export const selfDevelopment = "саморазвитие";
export const dating = "свидания";
export const family = "семья";
export const flowDescription = `
1. Саморазвитие
2. Саморазвитие + свидания (взаимоотношения)
3. Саморазвитие + свидания (взаимоотношения) + создание Семьи

* Логотип взаимосвязан с этим циклом, но является более обширным символом. Как считаете, что он означает ?
* _Обратите также внимание_: иконка семьи символизирует взаимоотношения между родителями и ребенком, но не определяет количество детей,
т.к. в полноценной семье их должно быть более одного.
`;
export const metaDescription = `${description}. Альтернатива сервисам love.ua, tinder.com, loveeto.com, badoo.com, mamba.ru и т.д. Необычный, ведический, славянский сайт знакомств для саморазвития, свиданий, встреч, смотрин, серьезных отношений, создания семьи в Украине, России.`;
export const proposal = "предложение";
export const Proposal = "Предложение";
export const Registration = "Регистрация";
export const Profile = "Профиль";
export const PairsAndDates = "Пары и Свидания";
export const Administration = "Администрирование";
export const Technologies = "Технологии";
export const logoTooltip = "Смотрины.укр & Смотрины.рус логотип";
export const email = "Почта";
export const updated = "Обновлено";
export const footer = "смотрины.укр & смотрины.рус";
export const license = "Лицензия";
export const acknowledgements = "Благодарности";
export const privacyPolicy = "Политика конфиденциальности";

export const Idea = "Идея";
export const FirstStage = "Первый этап пользования системой:";
export const FirstStageFirstStep =
  "1. Участники заполняют анкету, указывая свою эл. почту, пол, дату рождения, город, тип внешности, рост/вес, состояние здоровья и пр.;";
export const FirstStageSecondStep =
  "2. При соответствующих положительных собственных оценках здоровья, системой будут организованы свидания между подходящими по возрасту/городу участниками (В случае проблем со здоровьем, вредными привычками и пр. системой будут предложены способы их преодоления);";
export const FirstStageThirdStep =
  "3. Этап обратной связи, в котором участники решают хотят они продолжать отношения или нет. Вне зависимости от выбора, участники дают оценку правдивости анкет друг друга в вежливой и конструктивной форме;";
export const FirstStageFourthStep =
  '4. В случае совпадения желания обоих участников продолжать отношения они внимательно познают друг друга в реальной жизни и меняют цель использования системы с "хочу найти вторую половинку" на "хотим завести детей" (детали взаимодействия с системой на данном этапе будут оглашены позже). Иначе - происходит возврат ко второму шагу.';

export const AreDatingSitesNeeded = "Нужны ли вообще сайты знакомств?";
export const MotivationOfNeedTitle =
  "С точки зрения создателя данного ресурса в них есть польза для современного общества, заключающаяся в следующем:";
export const explicitIntention =
  "человек имеет возможность явно выразить свое желание найти свою вторую половинку (облегчая таким образом этот процес и для себя и для других пользователей со схожими целями);";
export const motivateSelfImprovement =
  "особенностью данного сайта также будет поощрение саморазвития участников, создания семьи и рождения детей.";
export const WhyNot =
  "Действительно, воспринимать Интернет ресурс как однозначное решение всех жизненных проблем не стоит, но можно добавить его к себе в помощники ";
export const AnotherDatingSite = "Очередной сайт знакомств?";
export const YesOneOfGoalsIsDating =
  "Да, одной из целей данного ресурса будет облегчение знакомств через сеть Интернет.";
export const ButThereAreDifferences =
  "Однако от существующих на текущий момент решений (love.ua, tinder.com, loveeto.com, badoo.com, mamba.ru) будет ряд существенных отличий, среди которых:";
export const onlyActiveParticipants =
  "только активные, уважающие друг друга пользователи (неактивные, нарушающие правила участники будут предупреждаться, а также блокироваться в случае продолжения подобного поведения);";
export const moreInvolvedSystem =
  "более активное участие системы для воплощения целей пользователей (участники не будут иметь возможности сидеть и просматривать анкеты друг друга, пары будет предлагать система);";
export const feedbackSystem =
  "система обратной связи после свиданий (возможно успешная пара получится не с первого раза, но конструктивный отзыв необходим в любом случае);";
export const fullFeaturedForFree =
  "возможность свободно пользоваться полноценной системой без рекламы, премиум подписок и прочего (возможность поддержать ресурс может быть только добровольной, если человек получил пользу и хочет отблагодарить его создателей) и пр.";
export const AboutSmotrinyRu =
  "Отдельного упоминания достоен сайт smotryni.ru, который ближе по духу (и имеющий такое же название) к идее описанной на данной странице (делает упор на хорошие качества участников, можно пользоваться всеми функциями без оплаты наперёд). Но принципиального функционального отличия, от существующих альтернатив у данного ресурса нет.";
export const OtherAlternatives =
  "Более подробный и полный разбор существующих альтернатив будет продолжен позднее (на отдельной странице, помощь приветствуется :) ), но если Вам известна прямая альтернатива идее изложенной здесь, то сообщите о ней!";
export const spreadTheWordIfSeemsInteresting =
  "Если идея кажется достойной внимания, то [регистрируйтесь](/регистрация), пользуйтесь и рассказывайте о сайте знакомым =)";

export const Email = "Почта для авторизации и обратной связи";
export const contactUs =
  "С вопросами или предложениями обращайтесь на почту (почтовый клиент должен быть доступен)";
export const contactUsButton = "Написать письмо";

export const emailVerification = "Подтверждение почты";
export const profileView = "Просмотр профиля";

export const sendNewToken = "Отправить новый токен";

export const firstStageFlowAlt =
  "Диаграмма схематически описывающая первый этап использования предлагаемой системы: анкета - самооценка и саморазвитие - свидания - обратная связь - если оба участника хотят продолжать отношения, то переход на следующий этап, иначе возврат на шаг 2.";

export const register = "Зарегистрироваться";
export const mail = "Почта";
export const login = "Вход";
export const enterUsingEmail = "Вход через Почту";
export const enterUsingFacebook = "Вход через Facebook";
export const enterUsingVk = "Вход через ВКонтакте";
export const willBeHardButFun =
  "Будет, вероятно, трудно, но интересно, полезно и по делу =) (16 обязательных и 2 добровольных на первом этапе поля). Смелее! Чем раньше на последующие вопросы обратить внимание, тем легче улучшить ситуацию ;)";
export const progressIsSaved =
  'Прогресс заполнения формы регистрации сохраняется в браузере. Используйте кнопку "Очистить" для удаления введенных данных.';

export const userAgreement = "Пользовательское соглашение";
export const status = "Статус";
export const acceptTermsOfUserAgreement =
  'Я прочёл/прочла и принимаю условия изложенные в "Пользовательском соглашении"';
export const decline = "Отказываюсь";
export const agreeToTerms = "Принимаю";
export const nickname = "Имя/псевдоним";
export const gender = "Пол";
export const female = "Женский";
export const male = "Мужской";
export const birthday = "Дата рождения (гггг-мм-дд)";
export const cancel = "Отмена";

export const height = "Рост";
export const cm = "См";

export const weight = "Вес";
export const kg = "Кг";

export const physicalExercise = "Физические упражнения";

export const smoking = "Употребление никотина";
export const smokingInfo = "(курение сигарет, вайп, снус и т.д.)";
export const alcohol = "Употребление алкоголя";
export const computerGames = "Компьютерные игры";
export const gambling = "Азартные игры";
export const gamblingInfo =
  "(казино, игровые автоматы, карты на деньги, лотереи, акции, курсы валют и т.д.)";
export const haircut = "Стрижка волос";
export const hairColoring = "Окрашивание волос";
export const makeup = "Использование макияжа / косметики / грима";
export const intimateRelationsOutsideOfMarriage =
  "Внесемейные интимные отношения"; // (понимание телегонии и её влияния на здоровье детей)
export const intimateRelationsInfo =
  "(интимная близость с человеком с которым в последствии не была создана семья)";
export const pornographyWatching = "Просмотр порнографии";

export const personalHealthEvaluation =
  "Личная оценка физического и психического здоровья на данный момент";

export const secondStageDialogTitle =
  "Активация второго этапа (свидания и встречи)";

export const areYouSureThatWantToRemoveProfile =
  "Вы уверены, что хотите удалить свой профиль?";
export const thisActionIsIrreversible = "Это действие нельзя будет отменить!";
export const yesContinue = "Да, продолжить";
export const areYouSureThatWantToSeeAuthorsProfile =
  "Выслать ссылку для просмотра профиля автора системы?";
export const whenYouLookAtOtherUserProfileThenOwnerWillKnowAboutThis =
  "Так как система стремится быть прозрачной, владелец профиля будет знать об этом.";
export const logout = "Выйти";

export const profileRemoval = "Удаление профиля";
export const reasonToRemove = "Причина удаления";
export const comment = "Комментарий";
export const moreDetailedReasoning =
  "более подробное описание причины удаления";
export const expectedSomethingElse = "Я ожидал(а) от сайта нечто другое";
export const tooComplicated = "Слишком сложно";
export const other = "Другая";
export const shouldBeLoggedIn = "Нужно сначала войти в систему";

export const registeredNumber = (number: any) =>
  `Количество зарегистрированных людей: ${number}`;
export const removedNumber = (number: any) =>
  `Количество удалений профилей: ${number}`;
export const unauthorized = "Не достаточно прав для просмотра этой страницы";
export const testEmail = "Тестовое письмо";
export const testEmailWasSent = "Тестовое письмо было отправлено";

export const profileTabsAria = "Табы профиля";
export const selfDevelopmentTab = "Саморазвитие";
export const datingProfileTab = "Свидания (Второй этап)";

export const matchedProfileTitle =
  "Профиль человека с которым была сформирована пара, поэтому рекомендуется внимательное ознакомление и проверка данных профиля при личной встрече. Доверяй, но проверяй :)";
export const authorsProfileTitle = "Профиль автора сайта";

export const pairsTab = "Пары";
export const user1 = "Польз.1";
export const user2 = "Польз.2";
export const dateStatus = "Статус";
export const goal = "Цель";
export const whenMatched = "Дата";
export const active = "Активна";
export const inactive = "Неактивна";
export const datingTableAria = "таблица пар";
export const viewMatchedUserProfile = (nickname: string) =>
  `Посмотреть профиль пользователя ${nickname}`;
export const areYouSureThatWantToOtherUsersProfile = (nickname: string) =>
  `Выслать ссылку для просмотра профиля ${nickname}?`;

export const dates = "Свидания";
export const latitudeLongitude = "широта/долгота";
export const where = "Где ?";
export const whenScheduled = "Когда ?";
export const notYetScheduled = "Дата и время пока не запланированы";
export const placeIsNotSettledYet = "Окончательное место пока не определено";
export const placeNeedsYourApproval =
  "Вам нужно проверить предложенное место встречи";
export const canViewPlaceOnlyWhilePreparingToGoOnDate =
  "Можно посмотреть место только во время подготовки к свиданию";
export const showPlace = "Посмотреть предложенное место встречи";
export const checkPlace = "Проверить";
export const placeIsWaitingForApprovalByOtherUser =
  "Ожидается проверка места встречи другим пользователем";
export const dateIsScheduled = "Свидание запланировано!";
export const partialCheckIn = "Часть пользователей прибыли на свидание!";
export const fullCheckIn = "Все пользователи прибыли на свидание!";
export const verified = "Свидание подтверждено!";

export const addLocation = "Добавление места встречи";
export const name = "Название места";
export const longitude = "Долгота";
export const latitude = "Широта";
export const add = "Предложить";
export const myLocation = "Моё расположение";

export const checkLocation = "Проверка места встречи";
export const approve = "Подтвердить";
export const suggestOtherPlace = "Предложить другое место";

export const viewLocation = "Просмотр места встречи";

export const addPlaceInformation = `
### Советы по выбору места:
* центр населенного пункта / парк / недалеко от известного памятника / здания и т.д.;
* отдавать предпочтение людным местам;
* возможность прогулок неподалеку, наличие кафе и прочего;
* простота нахождения и сообщения.
`;

export const otherUserApproves = `
Второй пользователь должен будет подтвердить, что предложенное место подходит по вышеупомянутым показателям.

Добавляя новое место, **пользователь соглашается, что оно будет также использовано системой в дальнейшем
(вне организации текущего свидания)** и не имеет возражений по этому поводу. Также в дальнейшем возможно изменение
данных введенных пользователем другими пользователями или системой.
`;

export const useTheMapAndTryToBeAccurate = `
Нажмите на карте для выбора точки (можно даже посетить это место и воспользоваться кнопкой "Мое расположение" ;) ).
Есть возможность увеличить или уменьшить масштаб карты для удобства, а также перетаскивать метку.

Постарайтесь быть точными :)
`;

export const approvalMeaning = `
Подтверждение места встречи значит, что оно с точки зрения Пользователя в достаточной мере соответствует "советам по выбору места" в начале страницы
и Пользователь согласен встретиться там.

Есть возможность предложить другое место встречи, но второй Пользователь должен будет также его утвердить.
Рекомендуется использование этой функции только в исключительных ситуациях если текущее место значительно
не соответствует рекомендациям в начале страницы.
`;

export const whatIsNext = "Что дальше ?";
export const viewPlace = "просмотр места";
export const meetingPlacePopup = "Место встречи";
export const myLocationPopup = "Моё расположение";
export const dateIsOrganizedWhatIsNextTitle =
  "Свидание организовано, что теперь ?";
export const dateIsOrganizedWhatIsNext = `
Следующий шаг - **прибыть вовремя на место встречи**, отметиться в системе (используя кнопку в меню *"Я на месте"* будучи вблизи точки встречи), **найти друг друга и общаться** :) (данные профиля о внешности и ник пользователя должны помочь в случае неопределенности - воспринимайте этот момент как игру ;) )

Далее один из участников должен *подтвердить свидание* посредством введения кода (через соответствующий пункт в меню), что был получен другим участником (это необходимо для полноценного использования системы).

Следуя принципу *"доверяй, но проверяй"* изучите профили друг друга и при личной встрече постарайтесь понять насколько они соответствуют действительности.
Впоследствии будет предоставлена возможность **оценить правдивость данных друг друга** и оставить *предложения по их улучшению* уместные с точки зрения соответствующих пользователей, что будет способствовать увеличению достоверности данных и, возможно, самосовершенствованию пользователей.

Также для увеличения достоверности рекомендуется посмотреть паспорта друг друга при встрече :)

Одна из важных целей на данном этапе - при наличии достаточного количества информации (жизненные взгляды, текущие цели), впечатлений и ощущений (внешность, звучание голоса, запах, комфорт во время общения и т.д.), понять хотите ли Вы продожения встреч и отношений или нет. Система может оказывать здесь только информационную поддержку.
**Обратите однако внимание**: при решении продолжать отношения (и создавать семью) нужно учитывать возраст участников (например (в упрощенной трактовке), юридически семейный союз в Украине и Российской Федерации можно создавать с 18 лет, а половые отношения допустимы с 16 лет) и возможности участников успешно содержать и развивать семью.

То, что время (а иногда и место) первого свидания определяются системой в автоматизированном режиме, имеет свои преимущества и ограничения. В случае невозможности прибытия на встречу в связи с весомыми причинами её можно будет перенести (кнопка *"Не получается прийти"*). Старайтесь, однако, приходить на свидания, так как это важно!

Дополнительные задания/идеи:
* познакомьтесь и обменяйтесь контактными данными;
* сделайте совместное фото;
* обговорите/уточните данные профилей, кто чем занимается и т.д.;
* сыграйте в гляделки;
* подержитесь за руки / пообнимайтесь :)

Дальнейшие свидания *могут* организовываться с помощью системы, но пользователи свободны самостоятельно продолжать общение друг с другом.

Дополнительная литература/темы для изучения:
* [Мужчины с Марса, женщины с Венеры - Грэй Джон](https://ru.wikipedia.org/wiki/Мужчины_с_Марса,_женщины_с_Венеры)
`;

export const checkIn = "Я на месте";
export const geolocationNeeded = "Нужен доступ к геолокации";
export const geolocationAccuracyIsPoor = "Низкая точность геолокации";

export const verifyDate = "Подтвердить свидание";
export const code = "Код";
