export const decision = "Решение";
export const decide = "Принять решение";
export const decisionOnCurrentPair =
  "Решение по продолжению отношений в текущей паре";
export const decisionLabel = "Решение по текущей паре";
export const wantToContinueRelationshipsAndCreateFamily =
  "Хочу продолжить отношения и создать семью";
export const doNotKnow = "Не знаю";
export const doNotWant = "Не хочу";
export const decideOnPairInfo = `
* выбор _продолжения отношений_ (в случае обоюдного решения) подразумевает изменение цели использования системы участниками на _"Есть вторая половинка, хотим создать семью"_ и приостановку в автоматизированном формировании пар;
* _"не знаю"_ подразумевает недостаток информации/ощущений которые необходимо получить посредством дополнительного общения/встреч;
* _"не хочу"_ включает в себя наличие принципиальных разногласий в образе жизни и/или других трудно формулируемых пожеланиях, что есть у участников ко второй половинке (были ли предложены соответствующие улучшения профиля ?).
`;
